"""
列表
Python中列表是可变的，这是它区别于字符串和元组的最重要的特点，一句话概括即：列表可以修改，而字符串和元组不能。
以下是Python 中列表的方法：
"""

l1 = list((1, 2, 3, 4, 5))
# 把一个元素添加到列表的结尾，相当于 a[len(a):] = [x]。
l1.append(6)
print(l1)

# 通过添加指定列表的所有元素来扩充列表 相当于 java中的 addAll()
l1.extend([7, 8, 9])
print(l1)

# 在指定位置插入一个元素
l1.insert(2, 100)
print(l1)

# 删除列表中值为 x 的第一个元素。如果没有这样的元素，就会返回一个错误。
l1.remove(100)
# l1.remove(1000)
print(l1)

# 从列表的指定位置移除元素，并将其返回。如果没有指定索引，a.pop()返回最后一个元素。元素随即从列表中被移除。
# （方法中 i 两边的方括号表示这个参数是可选的，而不是要求你输入一对方括号，你会经常在 Python 库参考手册中遇到这样的标记。）
p = l1.pop(2)
print(l1)
print(p)
# 删除最后一个元素
l1.pop()
print(l1)

# 移除列表中的所有项，等于del a[:]。
# l1.clear()
print(l1)


# 返回列表中第一个值为 x 的元素的索引。如果没有匹配的元素就会返回一个错误。
print(l1.index(2))
# print(l1.index(1000))
print(l1.index(2, 0))
print(l1.index(2, 0, 4))


# 返回 x 在列表中出现的次数。
print(l1.count(2))
print(l1.count(1000))

# 对列表中的元素进行排序。
l1.sort()
print(l1)

# 倒排列表中的元素。
l1.reverse()
print(l1)

# 返回列表的浅复制，等于a[:]。
print(l1.copy())
print(l1[:])

"""  
将列表当做堆栈使用
列表方法使得列表可以很方便的作为一个堆栈来使用，堆栈作为特定的数据结构，最先进入的元素最后一个被释放（后进先出）。
用 append() 方法可以把一个元素添加到堆栈顶。用不指定索引的 pop() 方法可以把一个元素从堆栈顶释放出来。例如：
"""


def push(x):
    l1.append(x)


def pop():
    return l1.pop()


print(l1)
push(100)
print(l1)
print(pop())
print(l1)


"""  
将列表当作队列使用
也可以把列表当做队列用，只是在队列里第一加入的元素，第一个取出来；但是拿列表用作这样的目的效率不高。
在列表的最后添加或者弹出元素速度快，然而在列表里插入或者从头部弹出速度却不快（因为所有其他的元素都得一个一个地移动）。
"""
from collections import deque

d1 = deque(l1)
print(d1)


# 嵌套列表解析
matrix = [
    [1, 2, 3, 4],
    [5, 6, 7, 8],
    [9, 10, 11, 12],
]
print(matrix)
x = [row[i] for row in matrix for i in range(4)]
print(x)

l2 = list()
for row in matrix:
    for i in range(4):
        l2.append(row[i])
print(l2)

"""  
del 语句
使用del 语句可以从一个列表中根据索引来删除一个元素，而不是值来删除元素。
这与使用 pop() 返回一个值不同。可以用 del 语句从列表中删除一个切割，或清空整个列表（我们以前介绍的方法是给该切割赋一个空列表）。例如：
"""
del l2[2]
print(l2)

# 也可以用 del 删除实体变量：
# del l2
print(l2)
print("=" * 20)

"""  
元组和序列
元组由若干逗号分隔的值组成
元组在输出时总是有括号的，以便于正确表达嵌套结构。在输入时可能有或没有括号， 不过括号通常是必须的（如果元组是更大的表达式的一部分）。
"""
t = (12345, 54321, "hello!")
print(t)
print(*t)


"""  
集合
集合是一个无序不重复元素的集。基本功能包括关系测试和消除重复元素。
可以用大括号({})创建集合。注意：如果要创建一个空集合，你必须用 set() 而不是 {} ；后者创建一个空的字典，
"""
s1 = set((1, 2, 3))
print(s1)

"""  
字典
序列是以连续的整数为索引，与此不同的是，字典以关键字为索引，关键字可以是任意不可变类型，通常用字符串或数值。
理解字典的最佳方式是把它看做无序的键=>值对集合。在同一个字典之内，关键字必须是互不相同。
一对大括号创建一个空的字典：{}。
"""
d1 = dict([('sape', 4139), ('guido', 4127), ('jack', 4098)])
print(d1)

# 遍历技巧
for k,v in d1.items():
    print(k,v)

for k in d1.keys():
    print(k, d1[k])