"""
Python中的字符串用单引号 ’ 或双引号 " 括起来，同时使用反斜杠 \ 转义特殊字符。
字符串的截取的语法格式如下：
变量[头下标:尾下标]
注意，Python 没有单独的字符类型，一个字符就是长度为1的字符串
1、 反斜杠可以用来转义，使用r可以让反斜杠不发生转义；
2、 字符串可以用+运算符连接在一起，用*运算符重复；
3、 Python中的字符串有两种索引方式，从左往右以0开始，从右往左以-1开始；
4、 Python中的字符串不能改变；
"""
from re import S


str = "Caiyua"
print("输出字符串", str)  # 输出字符串
print("输出第一个到倒数第二个的所有字符", str[0:-1])  # 输出第一个到倒数第二个的所有字符
print("输出字符串第一个字符", str[0])  # 输出字符串第一个字符
print("输出从第三个开始到第五个的字符", str[2:5])  # 输出从第三个开始到第五个的字符
print("输出从第三个开始的后的所有字符", str[2:])  # 输出从第三个开始的后的所有字符
print("输出字符串两次", str[0:5] * 2)  # 输出字符串两次，也可以写成 print (2 * str)
print("连接字符串", str + "TEST")  # 连接字符串
print("输出反转后的字符串", str[::-1])  # 输出反转后的字符串


# 反斜杠转移，   使用r可以禁止反斜杠的转移，直接输出反斜杠本身
print('Cu\nooa')
print(r'Cu\nooa')

# 续行符 \
print("hello \
world")

# 十六进制转义 \xHH 表示一个字符，HH 表示该字符的十六进制值
# print("\x48")
# 八进制转义 \012 表示换行符
# print("\012")
# \’ \" \a 响铃符 \f 表示换页符 \t 表示制表符 \v 表示垂直制表符 \n 表示换行符 \000 表示空字符 \b
print("hello\vworld")
print("hello \b world")


"""  
操作符	描述	实例
+	字符串连接	a + b 输出结果： HelloPython
*	重复输出字符串	a*2 输出结果：HelloHello
[]	通过索引获取字符串中字符	a[1] 输出结果 e
[ : ]	截取字符串中的一部分，遵循左闭右开原则，str[0:2] 是不包含第 3 个字符的。	a[1:4] 输出结果 ell
in	成员运算符 - 如果字符串中包含给定的字符返回 True	‘H’ in a 输出结果 True
not in	成员运算符 - 如果字符串中不包含给定的字符返回 True	‘M’ not in a 输出结果 True
r/R	原始字符串 - 原始字符串：所有的字符串都是直接按照字面的意思来使用，没有转义特殊或不能打印的字符。 原始字符串除在字符串的第一个引号前加上字母 r（可以大小写）以外，与普通字符串有着几乎完全相同的语法。	print( r’\n’ )
print( R’\n’ )
%	格式字符串	请看下一节内容。

"""
a = "Hello"
b = "Python"
print("a + b 输出结果：", a + b)
print("a * 2 输出结果：", a * 2)
print("a[1] 输出结果：", a[1])
print("a[1:4] 输出结果：", a[1:4])
if( "H" in a) :
    print("H 在变量 a 中")
else :
    print("H 不在变量 a 中")
if( "M" not in a) :
    print("M 不在变量 a 中")
else :
    print("M 在变量 a 中")
print (r'\n')
print (R'\n')

"""  
字符串格式化
Python 支持格式化字符串的输出 。尽管这样可能会用到非常复杂的表达式，但最基本的用法是将一个值插入到一个有字符串格式符 %s 的字符串中。
在Python 中，字符串格式化使用与 C 中 sprintf 函数一样的语法。
"""

print ("我叫 %s 今年 %d 岁!" % ('小明', 10))

"""  
python字符串格式化符号:
%c	格式化字符及其ASCII码
%s	格式化字符串
%d	格式化整数
%u	格式化无符号整型
%o	格式化无符号八进制数
%x	格式化无符号十六进制数
%X	格式化无符号十六进制数（大写）
%f	格式化浮点数字，可指定小数点后的精度
%e	用科学计数法格式化浮点数
%E	作用同%e，用科学计数法格式化浮点数
%g	%f和%e的简写
%G	%f 和 %E 的简写
%p	用十六进制数格式化变量的地址
"""

para_str = """这是一个多行字符串的实例
多行字符串可以使用制表符
TAB ( \t )。
也可以使用换行符 [ \n ]。
"""
print (para_str)


"""  
f-string
f-string 是 python3.6 之后版本添加的，称之为字面量格式化字符串，是新的格式化字符串的语法。
之前我们习惯用百分号 (%): print ("我叫 %s 今年 %d 岁!" % ('小明', 10))
用了这种方式明显更简单了，不用再去判断使用 %s，还是 %d。
"""
name = 'Caiyuan'
print(f'Hello {name}')


# 在Python 3.8 的版本中可以使用 = 符号来拼接运算表达式与结果： 
x = 1
print(f"运算结果为：{x+1=}")
print(f"运算结果为：{x+1}")